Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.

Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно

a = int(input())
n = 0
b = 0
if a ==0:
    print(a)
if a!=0:
    while (a+n)!=0:   
        n+=a       #Здесь мучался, от того, что не мог сделать переменную "а" по модулю. Поэтому добавил несколько дополнительных костылей.
        c = a*a    #Все переменные "а" будут возводиться в квадрат, можно было и по другому запись сделать, "a**2". 
        b+=c       #Храним все суммы квадратов переменной "a"
        d = n*n    #Тоже самое и для переменной "d"
        e = b+d    #Cумма квадратов. 
        a =int(input()) 
    print(e) 

14 строк. Бех костылей не обошлось. Думаю, индусы мною бы гордились. Похоже, что есть где-то дальние родственники в Дели.